Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_canfd.h
#define    CANFD_CFDWKSR_CFD0WKIF_Pos                             (0U)
#define    CANFD_CFDWKSR_CFD0WKIF_Msk                             (0x1U << CANFD_CFDWKSR_CFD0WKIF_Pos)
#define    CANFD_CFDWKSR_CFD0WKIF                                 CANFD_CFDWKSR_CFD0WKIF_Msk

#define    CANFD_CFDGTSTCFG_RTMPS_Pos                             (16U)
#define    CANFD_CFDGTSTCFG_RTMPS_Msk                             (0xfU << CANFD_CFDGTSTCFG_RTMPS_Pos)
#define    CANFD_CFDGTSTCFG_RTMPS                                 CANFD_CFDGTSTCFG_RTMPS_Msk

#define    CANFD_CFDGTSTCTR_RTME_Pos                              (2U)
#define    CANFD_CFDGTSTCTR_RTME_Msk                              (0x1U << CANFD_CFDGTSTCTR_RTME_Pos)
#define    CANFD_CFDGTSTCTR_RTME                                  CANFD_CFDGTSTCTR_RTME_Msk

#define    CANFD_CFDGFDCFG_TSCCFG_Pos                             (8U)
#define    CANFD_CFDGFDCFG_TSCCFG_Msk                             (0x3U << CANFD_CFDGFDCFG_TSCCFG_Pos)
#define    CANFD_CFDGFDCFG_TSCCFG                                 CANFD_CFDGFDCFG_TSCCFG_Msk

#define    CANFD_CFDGFDCFG_RPED_Pos                               (0U)
#define    CANFD_CFDGFDCFG_RPED_Msk                               (0x1U << CANFD_CFDGFDCFG_RPED_Pos)
#define    CANFD_CFDGFDCFG_RPED                                   CANFD_CFDGFDCFG_RPED_Msk

#define    CANFD_CFDGLOCKK_LOCK_Pos                               (0U)
#define    CANFD_CFDGLOCKK_LOCK_Msk                               (0xffffU << CANFD_CFDGLOCKK_LOCK_Pos)
#define    CANFD_CFDGLOCKK_LOCK                                   CANFD_CFDGLOCKK_LOCK_Msk

#define    CANFD_CFDRPGACCk_RDTA_Pos                              (0U)
#define    CANFD_CFDRPGACCk_RDTA_Msk                              (0xffffffffU << CANFD_CFDRPGACCk_RDTA_Pos)
#define    CANFD_CFDRPGACCk_RDTA                                  CANFD_CFDRPGACCk_RDTA_Msk

#define    CANFD_CFDGPFLECTR_PFLDAE_Pos                           (8U)
#define    CANFD_CFDGPFLECTR_PFLDAE_Msk                           (0x1U << CANFD_CFDGPFLECTR_PFLDAE_Pos)
#define    CANFD_CFDGPFLECTR_PFLDAE                               CANFD_CFDGPFLECTR_PFLDAE_Msk

#define    CANFD_CFDGPFLCFG_RNC_Pos                               (24U)
#define    CANFD_CFDGPFLCFG_RNC_Msk                               (0x3U << CANFD_CFDGPFLCFG_RNC_Pos)
#define    CANFD_CFDGPFLCFG_RNC                                   CANFD_CFDGPFLCFG_RNC_Msk

#define    CANFD_CFDGPFLIDs_GPFLIDE_Pos                           (31U)
#define    CANFD_CFDGPFLIDs_GPFLIDE_Msk                           (0x1U << CANFD_CFDGPFLIDs_GPFLIDE_Pos)
#define    CANFD_CFDGPFLIDs_GPFLIDE                               CANFD_CFDGPFLIDs_GPFLIDE_Msk

#define    CANFD_CFDGPFLIDs_GPFLRTR_Pos                           (30U)
#define    CANFD_CFDGPFLIDs_GPFLRTR_Msk                           (0x1U << CANFD_CFDGPFLIDs_GPFLRTR_Pos)
#define    CANFD_CFDGPFLIDs_GPFLRTR                               CANFD_CFDGPFLIDs_GPFLRTR_Msk

#define    CANFD_CFDGPFLIDs_GPFLLB_Pos                            (29U)
#define    CANFD_CFDGPFLIDs_GPFLLB_Msk                            (0x1U << CANFD_CFDGPFLIDs_GPFLLB_Pos)
#define    CANFD_CFDGPFLIDs_GPFLLB                                CANFD_CFDGPFLIDs_GPFLLB_Msk

#define    CANFD_CFDGPFLIDs_GPFLID_Pos                            (0U)
#define    CANFD_CFDGPFLIDs_GPFLID_Msk                            (0x1fffffffU << CANFD_CFDGPFLIDs_GPFLID_Pos)
#define    CANFD_CFDGPFLIDs_GPFLID                                CANFD_CFDGPFLIDs_GPFLID_Msk

#define    CANFD_CFDGPFLMs_GPFLIDEM_Pos                           (31U)
#define    CANFD_CFDGPFLMs_GPFLIDEM_Msk                           (0x1U << CANFD_CFDGPFLMs_GPFLIDEM_Pos)
#define    CANFD_CFDGPFLMs_GPFLIDEM                               CANFD_CFDGPFLMs_GPFLIDEM_Msk

#define    CANFD_CFDGPFLMs_GPFLRTRM_Pos                           (30U)
#define    CANFD_CFDGPFLMs_GPFLRTRM_Msk                           (0x1U << CANFD_CFDGPFLMs_GPFLRTRM_Pos)
#define    CANFD_CFDGPFLMs_GPFLRTRM                               CANFD_CFDGPFLMs_GPFLRTRM_Msk

#define    CANFD_CFDGPFLMs_GPFLIFL1_Pos                           (29U)
#define    CANFD_CFDGPFLMs_GPFLIFL1_Msk                           (0x1U << CANFD_CFDGPFLMs_GPFLIFL1_Pos)
#define    CANFD_CFDGPFLMs_GPFLIFL1                               CANFD_CFDGPFLMs_GPFLIFL1_Msk

#define    CANFD_CFDGPFLMs_GPFLIDM_Pos                            (0U)
#define    CANFD_CFDGPFLMs_GPFLIDM_Msk                            (0x1fffffffU << CANFD_CFDGPFLMs_GPFLIDM_Pos)
#define    CANFD_CFDGPFLMs_GPFLIDM                                CANFD_CFDGPFLMs_GPFLIDM_Msk

#define    CANFD_CFDGPFLP0s_GPFLPTR_Pos                           (16U)
#define    CANFD_CFDGPFLP0s_GPFLPTR_Msk                           (0xffffU << CANFD_CFDGPFLP0s_GPFLPTR_Pos)
#define    CANFD_CFDGPFLP0s_GPFLPTR                               CANFD_CFDGPFLP0s_GPFLPTR_Msk

#define    CANFD_CFDGPFLP0s_GPFLRMV_Pos                           (15U)
#define    CANFD_CFDGPFLP0s_GPFLRMV_Msk                           (0x1U << CANFD_CFDGPFLP0s_GPFLRMV_Pos)
#define    CANFD_CFDGPFLP0s_GPFLRMV                               CANFD_CFDGPFLP0s_GPFLRMV_Msk

#define    CANFD_CFDGPFLP0s_GPFLRMDP_Pos                          (8U)
#define    CANFD_CFDGPFLP0s_GPFLRMDP_Msk                          (0x1fU << CANFD_CFDGPFLP0s_GPFLRMDP_Pos)
#define    CANFD_CFDGPFLP0s_GPFLRMDP                              CANFD_CFDGPFLP0s_GPFLRMDP_Msk

#define    CANFD_CFDGPFLP0s_GPFLIFL0_Pos                          (7U)
#define    CANFD_CFDGPFLP0s_GPFLIFL0_Msk                          (0x1U << CANFD_CFDGPFLP0s_GPFLIFL0_Pos)
#define    CANFD_CFDGPFLP0s_GPFLIFL0                              CANFD_CFDGPFLP0s_GPFLIFL0_Msk

#define    CANFD_CFDGPFLP0s_GPFLDLC_Pos                           (0U)
#define    CANFD_CFDGPFLP0s_GPFLDLC_Msk                           (0xfU << CANFD_CFDGPFLP0s_GPFLDLC_Pos)
#define    CANFD_CFDGPFLP0s_GPFLDLC                               CANFD_CFDGPFLP0s_GPFLDLC_Msk

#define    CANFD_CFDGPFLP1s_GPFLFDPH_Pos                          (8U)
#define    CANFD_CFDGPFLP1s_GPFLFDPH_Msk                          (0x1U << CANFD_CFDGPFLP1s_GPFLFDPH_Pos)
#define    CANFD_CFDGPFLP1s_GPFLFDPH                              CANFD_CFDGPFLP1s_GPFLFDPH_Msk

