Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_canfd.h
#define    CANFD_CFDRMFDSTS_RMFDF_Pos                             (2U)
#define    CANFD_CFDRMFDSTS_RMFDF_Msk                             (0x1U << CANFD_CFDRMFDSTS_RMFDF_Pos)
#define    CANFD_CFDRMFDSTS_RMFDF                                 CANFD_CFDRMFDSTS_RMFDF_Msk

#define    CANFD_CFDRMFDSTS_RMBRS_Pos                             (1U)
#define    CANFD_CFDRMFDSTS_RMBRS_Msk                             (0x1U << CANFD_CFDRMFDSTS_RMBRS_Pos)
#define    CANFD_CFDRMFDSTS_RMBRS                                 CANFD_CFDRMFDSTS_RMBRS_Msk

#define    CANFD_CFDRMFDSTS_RMESI_Pos                             (0U)
#define    CANFD_CFDRMFDSTS_RMESI_Msk                             (0x1U << CANFD_CFDRMFDSTS_RMESI_Pos)
#define    CANFD_CFDRMFDSTS_RMESI                                 CANFD_CFDRMFDSTS_RMESI_Msk

#define    CANFD_CFDRMDFp_RMDB_Pos                                (0U)
#define    CANFD_CFDRMDFp_RMDB_Msk                                (0xffffffffU << CANFD_CFDRMDFp_RMDB_Pos)
#define    CANFD_CFDRMDFp_RMDB                                    CANFD_CFDRMDFp_RMDB_Msk

#define    CANFD_CFDRFID_RFIDE_Pos                                (31U)
#define    CANFD_CFDRFID_RFIDE_Msk                                (0x1U << CANFD_CFDRFID_RFIDE_Pos)
#define    CANFD_CFDRFID_RFIDE                                    CANFD_CFDRFID_RFIDE_Msk

#define    CANFD_CFDRFID_RFRTR_Pos                                (30U)
#define    CANFD_CFDRFID_RFRTR_Msk                                (0x1U << CANFD_CFDRFID_RFRTR_Pos)
#define    CANFD_CFDRFID_RFRTR                                    CANFD_CFDRFID_RFRTR_Msk

#define    CANFD_CFDRFID_RFID_Pos                                 (0U)
#define    CANFD_CFDRFID_RFID_Msk                                 (0x1fffffffU << CANFD_CFDRFID_RFID_Pos)
#define    CANFD_CFDRFID_RFID                                     CANFD_CFDRFID_RFID_Msk

#define    CANFD_CFDRFPTR_RFDLC_Pos                               (28U)
#define    CANFD_CFDRFPTR_RFDLC_Msk                               (0xfU << CANFD_CFDRFPTR_RFDLC_Pos)
#define    CANFD_CFDRFPTR_RFDLC                                   CANFD_CFDRFPTR_RFDLC_Msk

#define    CANFD_CFDRFPTR_RFTS_Pos                                (0U)
#define    CANFD_CFDRFPTR_RFTS_Msk                                (0xffffU << CANFD_CFDRFPTR_RFTS_Pos)
#define    CANFD_CFDRFPTR_RFTS                                    CANFD_CFDRFPTR_RFTS_Msk

#define    CANFD_CFDRFFDSTS_CFDRFPTR_Pos                          (16U)
#define    CANFD_CFDRFFDSTS_CFDRFPTR_Msk                          (0xffffU << CANFD_CFDRFFDSTS_CFDRFPTR_Pos)
#define    CANFD_CFDRFFDSTS_CFDRFPTR                              CANFD_CFDRFFDSTS_CFDRFPTR_Msk

#define    CANFD_CFDRFFDSTS_RFIFL_Pos                             (8U)
#define    CANFD_CFDRFFDSTS_RFIFL_Msk                             (0x3U << CANFD_CFDRFFDSTS_RFIFL_Pos)
#define    CANFD_CFDRFFDSTS_RFIFL                                 CANFD_CFDRFFDSTS_RFIFL_Msk

#define    CANFD_CFDRFFDSTS_RFFDF_Pos                             (2U)
#define    CANFD_CFDRFFDSTS_RFFDF_Msk                             (0x1U << CANFD_CFDRFFDSTS_RFFDF_Pos)
#define    CANFD_CFDRFFDSTS_RFFDF                                 CANFD_CFDRFFDSTS_RFFDF_Msk

#define    CANFD_CFDRFFDSTS_RFBRS_Pos                             (1U)
#define    CANFD_CFDRFFDSTS_RFBRS_Msk                             (0x1U << CANFD_CFDRFFDSTS_RFBRS_Pos)
#define    CANFD_CFDRFFDSTS_RFBRS                                 CANFD_CFDRFFDSTS_RFBRS_Msk

#define    CANFD_CFDRFFDSTS_RFESI_Pos                             (0U)
#define    CANFD_CFDRFFDSTS_RFESI_Msk                             (0x1U << CANFD_CFDRFFDSTS_RFESI_Pos)
#define    CANFD_CFDRFFDSTS_RFESI                                 CANFD_CFDRFFDSTS_RFESI_Msk

#define    CANFD_CFDRFDFp_RFDB_Pos                                (0U)
#define    CANFD_CFDRFDFp_RFDB_Msk                                (0xffffffffU << CANFD_CFDRFDFp_RFDB_Pos)
#define    CANFD_CFDRFDFp_RFDB                                    CANFD_CFDRFDFp_RFDB_Msk

#define    CANFD_CFDCFID_CFIDE_Pos                                (31U)
#define    CANFD_CFDCFID_CFIDE_Msk                                (0x1U << CANFD_CFDCFID_CFIDE_Pos)
#define    CANFD_CFDCFID_CFIDE                                    CANFD_CFDCFID_CFIDE_Msk

#define    CANFD_CFDCFID_CFRTR_Pos                                (30U)
#define    CANFD_CFDCFID_CFRTR_Msk                                (0x1U << CANFD_CFDCFID_CFRTR_Pos)
#define    CANFD_CFDCFID_CFRTR                                    CANFD_CFDCFID_CFRTR_Msk

#define    CANFD_CFDCFID_THLEN_Pos                                (29U)
#define    CANFD_CFDCFID_THLEN_Msk                                (0x1U << CANFD_CFDCFID_THLEN_Pos)
#define    CANFD_CFDCFID_THLEN                                    CANFD_CFDCFID_THLEN_Msk

#define    CANFD_CFDCFID_CFID_Pos                                 (0U)
#define    CANFD_CFDCFID_CFID_Msk                                 (0x1fffffffU << CANFD_CFDCFID_CFID_Pos)
#define    CANFD_CFDCFID_CFID                                     CANFD_CFDCFID_CFID_Msk

#define    CANFD_CFDCFPTR_CFDLC_Pos                               (28U)
#define    CANFD_CFDCFPTR_CFDLC_Msk                               (0xfU << CANFD_CFDCFPTR_CFDLC_Pos)
#define    CANFD_CFDCFPTR_CFDLC                                   CANFD_CFDCFPTR_CFDLC_Msk

#define    CANFD_CFDCFPTR_CFTS_Pos                                (0U)
#define    CANFD_CFDCFPTR_CFTS_Msk                                (0xffffU << CANFD_CFDCFPTR_CFTS_Pos)
#define    CANFD_CFDCFPTR_CFTS                                    CANFD_CFDCFPTR_CFTS_Msk

#define    CANFD_CFDCFFDCSTS_CFPTR_Pos                            (16U)
#define    CANFD_CFDCFFDCSTS_CFPTR_Msk                            (0xffffU << CANFD_CFDCFFDCSTS_CFPTR_Pos)
#define    CANFD_CFDCFFDCSTS_CFPTR                                CANFD_CFDCFFDCSTS_CFPTR_Msk

#define    CANFD_CFDCFFDCSTS_CFIFL_Pos                            (8U)
#define    CANFD_CFDCFFDCSTS_CFIFL_Msk                            (0x3U << CANFD_CFDCFFDCSTS_CFIFL_Pos)
#define    CANFD_CFDCFFDCSTS_CFIFL                                CANFD_CFDCFFDCSTS_CFIFL_Msk

#define    CANFD_CFDCFFDCSTS_CFFDF_Pos                            (2U)
#define    CANFD_CFDCFFDCSTS_CFFDF_Msk                            (0x1U << CANFD_CFDCFFDCSTS_CFFDF_Pos)
#define    CANFD_CFDCFFDCSTS_CFFDF                                CANFD_CFDCFFDCSTS_CFFDF_Msk

#define    CANFD_CFDCFFDCSTS_CFBRS_Pos                            (1U)
#define    CANFD_CFDCFFDCSTS_CFBRS_Msk                            (0x1U << CANFD_CFDCFFDCSTS_CFBRS_Pos)
#define    CANFD_CFDCFFDCSTS_CFBRS                                CANFD_CFDCFFDCSTS_CFBRS_Msk

#define    CANFD_CFDCFFDCSTS_CFESI_Pos                            (0U)
#define    CANFD_CFDCFFDCSTS_CFESI_Msk                            (0x1U << CANFD_CFDCFFDCSTS_CFESI_Pos)
#define    CANFD_CFDCFFDCSTS_CFESI                                CANFD_CFDCFFDCSTS_CFESI_Msk

#define    CANFD_CFDCFDFp_CFDB_Pos                                (0U)
#define    CANFD_CFDCFDFp_CFDB_Msk                                (0xffffffffU << CANFD_CFDCFDFp_CFDB_Pos)
#define    CANFD_CFDCFDFp_CFDB                                    CANFD_CFDCFDFp_CFDB_Msk

#define    CANFD_CFDTMID_TMIDE_Pos                                (31U)
#define    CANFD_CFDTMID_TMIDE_Msk                                (0x1U << CANFD_CFDTMID_TMIDE_Pos)
#define    CANFD_CFDTMID_TMIDE                                    CANFD_CFDTMID_TMIDE_Msk

#define    CANFD_CFDTMID_TMRTR_Pos                                (30U)
#define    CANFD_CFDTMID_TMRTR_Msk                                (0x1U << CANFD_CFDTMID_TMRTR_Pos)
#define    CANFD_CFDTMID_TMRTR                                    CANFD_CFDTMID_TMRTR_Msk

#define    CANFD_CFDTMID_THLEN_Pos                                (29U)
#define    CANFD_CFDTMID_THLEN_Msk                                (0x1U << CANFD_CFDTMID_THLEN_Pos)
#define    CANFD_CFDTMID_THLEN                                    CANFD_CFDTMID_THLEN_Msk

#define    CANFD_CFDTMID_TMID_Pos                                 (0U)
#define    CANFD_CFDTMID_TMID_Msk                                 (0x1fffffffU << CANFD_CFDTMID_TMID_Pos)
#define    CANFD_CFDTMID_TMID                                     CANFD_CFDTMID_TMID_Msk

#define    CANFD_CFDTMPTR_TMDLC_Pos                               (28U)
#define    CANFD_CFDTMPTR_TMDLC_Msk                               (0xfU << CANFD_CFDTMPTR_TMDLC_Pos)
#define    CANFD_CFDTMPTR_TMDLC                                   CANFD_CFDTMPTR_TMDLC_Msk

#define    CANFD_CFDTMFDCTR_TMPTR_Pos                             (16U)
#define    CANFD_CFDTMFDCTR_TMPTR_Msk                             (0xffffU << CANFD_CFDTMFDCTR_TMPTR_Pos)
#define    CANFD_CFDTMFDCTR_TMPTR                                 CANFD_CFDTMFDCTR_TMPTR_Msk

#define    CANFD_CFDTMFDCTR_TMIFL_Pos                             (8U)
#define    CANFD_CFDTMFDCTR_TMIFL_Msk                             (0x3U << CANFD_CFDTMFDCTR_TMIFL_Pos)
#define    CANFD_CFDTMFDCTR_TMIFL                                 CANFD_CFDTMFDCTR_TMIFL_Msk

