Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_canfd.h
#define    FL_CANFD_EOC_CONFIGURATION_ALL                         (0x0U << CANFD_CFDC0FDCFG_EOCCFG_Pos)
#define    FL_CANFD_EOC_CONFIGURATION_TRANSMITTER                 (0x1U << CANFD_CFDC0FDCFG_EOCCFG_Pos)
#define    FL_CANFD_EOC_CONFIGURATION_RECEIVER                    (0x2U << CANFD_CFDC0FDCFG_EOCCFG_Pos)
#define    FL_CANFD_EOC_CONFIGURATION_ALL_FD_DATAPHASE            (0x4U << CANFD_CFDC0FDCFG_EOCCFG_Pos)
#define    FL_CANFD_EOC_CONFIGURATION_TRANSMITTER_FD_DATAPHASE    (0x5U << CANFD_CFDC0FDCFG_EOCCFG_Pos)
#define    FL_CANFD_EOC_CONFIGURATION_RECEIVER_FD_DATAPHASE       (0x6U << CANFD_CFDC0FDCFG_EOCCFG_Pos)


#define    FL_CANFD_PNF_MODE_AF                                   (0x0U << CANFD_CFDC0FDCTR_PNMDC_Pos)
#define    FL_CANFD_PNF_MODE_PNFID_AF                             (0x1U << CANFD_CFDC0FDCTR_PNMDC_Pos)
#define    FL_CANFD_PNF_MODE_PNF_AF                               (0x2U << CANFD_CFDC0FDCTR_PNMDC_Pos)
#define    FL_CANFD_PNF_MODE_PNF                                  (0x3U << CANFD_CFDC0FDCTR_PNMDC_Pos)


#define    FL_CANFD_PNF_STATE_AF                                  (0x0U << CANFD_CFDC0FDSTS_PNSTS_Pos)
#define    FL_CANFD_PNF_STATE_PNFID_AF                            (0x1U << CANFD_CFDC0FDSTS_PNSTS_Pos)
#define    FL_CANFD_PNF_STATE_PNF_AF                              (0x2U << CANFD_CFDC0FDSTS_PNSTS_Pos)
#define    FL_CANFD_PNF_STATE_PNF                                 (0x3U << CANFD_CFDC0FDSTS_PNSTS_Pos)

#define    FL_CANFD_TSSS_CLOCK_PERIPHERAL                         (0x0U << CANFD_CFDGCFG_TSSS_Pos)
#define    FL_CANFD_TSSS_CLOCK_BIT_TIME                           (0x1U << CANFD_CFDGCFG_TSSS_Pos)


#define    FL_CANFD_TSP_PSC_1                                     (0x0U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_2                                     (0x1U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_4                                     (0x2U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_8                                     (0x3U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_16                                    (0x4U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_32                                    (0x5U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_64                                    (0x6U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_128                                   (0x7U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_256                                   (0x8U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_512                                   (0x9U << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_1024                                  (0xaU << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_2048                                  (0xbU << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_4096                                  (0xcU << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_8192                                  (0xdU << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_16384                                 (0xeU << CANFD_CFDGCFG_TSP_Pos)
#define    FL_CANFD_TSP_PSC_32768                                 (0xfU << CANFD_CFDGCFG_TSP_Pos)


#define    FL_CANFD_CMPOC_CONFIGURATION_REJECTED                  (0x0U << CANFD_CFDGCFG_CMPOC_Pos)
#define    FL_CANFD_CMPOC_CONFIGURATION_CUTOFF                    (0x1U << CANFD_CFDGCFG_CMPOC_Pos)


#define    FL_CANFD_DCS_CLOCK_INTERNAL                            (0x0U << CANFD_CFDGCFG_DCS_Pos)
#define    FL_CANFD_DCS_CLOCK_EXTRENAL                            (0x1U << CANFD_CFDGCFG_DCS_Pos)


#define    FL_CANFD_TX_PRIORITY_ID                                (0x0U << CANFD_CFDGCFG_TPRI_Pos)
#define    FL_CANFD_TX_PRIORITY_BUFFER                            (0x1U << CANFD_CFDGCFG_TPRI_Pos)


#define    FL_CANFD_TS_RST_NO_RESET                               (0x0U << CANFD_CFDGCTR_TSRST_Pos)
#define    FL_CANFD_TS_RST_RESET                                  (0x1U << CANFD_CFDGCTR_TSRST_Pos)


#define    FL_CANFD_GLOBAL_MODE_OPERATION                         (0x0U << CANFD_CFDGCTR_GMDC_Pos)
#define    FL_CANFD_GLOBAL_MODE_RESET                             (0x1U << CANFD_CFDGCTR_GMDC_Pos)
#define    FL_CANFD_GLOBAL_MODE_HALT                              (0x2U << CANFD_CFDGCTR_GMDC_Pos)
#define    FL_CANFD_GLOBAL_MODE_KEEP_CURRENT                      (0x3U << CANFD_CFDGCTR_GMDC_Pos)


#define    FL_CANFD_GAFL_PAGE_NUMBER_FIRST                        (0x0U << CANFD_CFDGAFLECTR_AFLPN_Pos)
#define    FL_CANFD_GAFL_PAGE_NUMBER_SECOND                       (0x1U << CANFD_CFDGAFLECTR_AFLPN_Pos)


#define    FL_CANFD_GAFL_IDE_STANDARD                             (0x0U << CANFD_CFDGAFLIDr_GAFLIDE_Pos)
#define    FL_CANFD_GAFL_IDE_EXTENDED                             (0x1U << CANFD_CFDGAFLIDr_GAFLIDE_Pos)


#define    FL_CANFD_GAFL_RTR_DATA_FRAME                           (0x0U << CANFD_CFDGAFLIDr_GAFLRTR_Pos)
#define    FL_CANFD_GAFL_RTR_REMOTE_FRAME                         (0x1U << CANFD_CFDGAFLIDr_GAFLRTR_Pos)


#define    FL_CANFD_GAFL_LB_RX                                    (0x0U << CANFD_CFDGAFLIDr_GAFLLB_Pos)
#define    FL_CANFD_GAFL_LB_TX                                    (0x1U << CANFD_CFDGAFLIDr_GAFLLB_Pos)


#define    FL_CANFD_GAFL_IDEM_NOT_CONSIDERED                      (0x0U << CANFD_CFDGAFLMr_GAFLIDEM_Pos)
#define    FL_CANFD_GAFL_IDEM_CONSIDERED                          (0x1U << CANFD_CFDGAFLMr_GAFLIDEM_Pos)


#define    FL_CANFD_GAFL_RTRM_NOT_CONSIDERED                      (0x0U << CANFD_CFDGAFLMr_GAFLRTRM_Pos)
#define    FL_CANFD_GAFL_RTRM_CONSIDERED                          (0x1U << CANFD_CFDGAFLMr_GAFLRTRM_Pos)


#define    FL_CANFD_GAFL_INFO_LABEL1_0                            (0x0U << CANFD_CFDGAFLMr_GAFLIFL1_Pos)
#define    FL_CANFD_GAFL_INFO_LABEL1_1                            (0x1U << CANFD_CFDGAFLMr_GAFLIFL1_Pos)


#define    FL_CANFD_GAFL_SINGLE_RXMB_INVALID                      (0x0U << CANFD_CFDGAFLP0r_GAFLRMV_Pos)
#define    FL_CANFD_GAFL_SINGLE_RXMB_VALID                        (0x1U << CANFD_CFDGAFLP0r_GAFLRMV_Pos)


#define    FL_CANFD_GAFL_INFO_LABEL0_0                            (0x0U << CANFD_CFDGAFLP0r_GAFLIFL0_Pos)
#define    FL_CANFD_GAFL_INFO_LABEL0_1                            (0x1U << CANFD_CFDGAFLP0r_GAFLIFL0_Pos)


#define    FL_CANFD_RMPLS_SIZE_8                                  (0x0U << CANFD_CFDRMNB_RMPLS_Pos)
#define    FL_CANFD_RMPLS_SIZE_12                                 (0x1U << CANFD_CFDRMNB_RMPLS_Pos)
#define    FL_CANFD_RMPLS_SIZE_16                                 (0x2U << CANFD_CFDRMNB_RMPLS_Pos)
#define    FL_CANFD_RMPLS_SIZE_20                                 (0x3U << CANFD_CFDRMNB_RMPLS_Pos)
#define    FL_CANFD_RMPLS_SIZE_24                                 (0x4U << CANFD_CFDRMNB_RMPLS_Pos)
#define    FL_CANFD_RMPLS_SIZE_32                                 (0x5U << CANFD_CFDRMNB_RMPLS_Pos)
#define    FL_CANFD_RMPLS_SIZE_48                                 (0x6U << CANFD_CFDRMNB_RMPLS_Pos)
#define    FL_CANFD_RMPLS_SIZE_64                                 (0x7U << CANFD_CFDRMNB_RMPLS_Pos)


#define    FL_CANFD_RFIGCV_1P8_FULL                               (0x0U << CANFD_CFDRFCCa_RFIGCV_Pos)
#define    FL_CANFD_RFIGCV_1P4_FULL                               (0x1U << CANFD_CFDRFCCa_RFIGCV_Pos)
#define    FL_CANFD_RFIGCV_3P8_FULL                               (0x2U << CANFD_CFDRFCCa_RFIGCV_Pos)
#define    FL_CANFD_RFIGCV_1P2_FULL                               (0x3U << CANFD_CFDRFCCa_RFIGCV_Pos)
#define    FL_CANFD_RFIGCV_5P8_FULL                               (0x4U << CANFD_CFDRFCCa_RFIGCV_Pos)
#define    FL_CANFD_RFIGCV_3P4_FULL                               (0x5U << CANFD_CFDRFCCa_RFIGCV_Pos)
#define    FL_CANFD_RFIGCV_7P8_FULL                               (0x6U << CANFD_CFDRFCCa_RFIGCV_Pos)
#define    FL_CANFD_RFIGCV_FULL                                   (0x7U << CANFD_CFDRFCCa_RFIGCV_Pos)


#define    FL_CANFD_RFIM_REACH_RFIGCV                             (0x0U << CANFD_CFDRFCCa_RFIM_Pos)
#define    FL_CANFD_RFIM_EVERY_MESSAGE                            (0x1U << CANFD_CFDRFCCa_RFIM_Pos)


#define    FL_CANFD_RFDC_DEPTH_0                                  (0x0U << CANFD_CFDRFCCa_RFDC_Pos)
#define    FL_CANFD_RFDC_DEPTH_4                                  (0x1U << CANFD_CFDRFCCa_RFDC_Pos)
#define    FL_CANFD_RFDC_DEPTH_8                                  (0x2U << CANFD_CFDRFCCa_RFDC_Pos)
#define    FL_CANFD_RFDC_DEPTH_16                                 (0x3U << CANFD_CFDRFCCa_RFDC_Pos)
#define    FL_CANFD_RFDC_DEPTH_32                                 (0x4U << CANFD_CFDRFCCa_RFDC_Pos)
#define    FL_CANFD_RFDC_DEPTH_48                                 (0x5U << CANFD_CFDRFCCa_RFDC_Pos)


#define    FL_CANFD_RFPLS_SIZE_8                                  (0x0U << CANFD_CFDRFCCa_RFPLS_Pos)
#define    FL_CANFD_RFPLS_SIZE_12                                 (0x1U << CANFD_CFDRFCCa_RFPLS_Pos)
#define    FL_CANFD_RFPLS_SIZE_16                                 (0x2U << CANFD_CFDRFCCa_RFPLS_Pos)
#define    FL_CANFD_RFPLS_SIZE_20                                 (0x3U << CANFD_CFDRFCCa_RFPLS_Pos)
#define    FL_CANFD_RFPLS_SIZE_24                                 (0x4U << CANFD_CFDRFCCa_RFPLS_Pos)
#define    FL_CANFD_RFPLS_SIZE_32                                 (0x5U << CANFD_CFDRFCCa_RFPLS_Pos)
#define    FL_CANFD_RFPLS_SIZE_48                                 (0x6U << CANFD_CFDRFCCa_RFPLS_Pos)
#define    FL_CANFD_RFPLS_SIZE_64                                 (0x7U << CANFD_CFDRFCCa_RFPLS_Pos)


