Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_canfd.h
#define    FL_CANFD_GPFL_LB_RX                                    (0x0U << CANFD_CFDGPFLIDs_GPFLLB_Pos)
#define    FL_CANFD_GPFL_LB_TX                                    (0x1U << CANFD_CFDGPFLIDs_GPFLLB_Pos)


#define    FL_CANFD_GPFL_IDEM_NOT_CONSIDERED                      (0x0U << CANFD_CFDGPFLMs_GPFLIDEM_Pos)
#define    FL_CANFD_GPFL_IDEM_CONSIDERED                          (0x1U << CANFD_CFDGPFLMs_GPFLIDEM_Pos)


#define    FL_CANFD_GPFL_RTRM_NOT_CONSIDERED                      (0x0U << CANFD_CFDGPFLMs_GPFLRTRM_Pos)
#define    FL_CANFD_GPFL_RTRM_CONSIDERED                          (0x1U << CANFD_CFDGPFLMs_GPFLRTRM_Pos)


#define    FL_CANFD_GPFL_INFO_LABEL1_0                            (0x0U << CANFD_CFDGPFLMs_GPFLIFL1_Pos)
#define    FL_CANFD_GPFL_INFO_LABEL1_1                            (0x1U << CANFD_CFDGPFLMs_GPFLIFL1_Pos)


#define    FL_CANFD_GPFL_SINGLE_RXMB_INVALID                      (0x0U << CANFD_CFDGPFLP0s_GPFLRMV_Pos)
#define    FL_CANFD_GPFL_SINGLE_RXMB_VALID                        (0x1U << CANFD_CFDGPFLP0s_GPFLRMV_Pos)


#define    FL_CANFD_GPFL_INFO_LABEL0_0                            (0x0U << CANFD_CFDGPFLP0s_GPFLIFL0_Pos)
#define    FL_CANFD_GPFL_INFO_LABEL0_1                            (0x1U << CANFD_CFDGPFLP0s_GPFLIFL0_Pos)


#define    FL_CANFD_GPFLANDOR_AND                                 (0x0U << CANFD_CFDGPFLPTs_GPFLANDOR_Pos)
#define    FL_CANFD_GPFLANDOR_OR                                  (0x1U << CANFD_CFDGPFLPTs_GPFLANDOR_Pos)


#define    FL_CANFD_GPFLRANG0_MATCH                               (0x0U << CANFD_CFDGPFLPTs_GPFLRANG0_Pos)
#define    FL_CANFD_GPFLRANG0_RANGE                               (0x1U << CANFD_CFDGPFLPTs_GPFLRANG0_Pos)


#define    FL_CANFD_GPFLOUT0_WITHIN                               (0x0U << CANFD_CFDGPFLPTs_GPFLOUT0_Pos)
#define    FL_CANFD_GPFLOUT0_OUTSIDE                              (0x1U << CANFD_CFDGPFLPTs_GPFLOUT0_Pos)


#define    FL_CANFD_GPFLRANG1_MATCH                               (0x0U << CANFD_CFDGPFLPTs_GPFLRANG1_Pos)
#define    FL_CANFD_GPFLRANG1_RANGE                               (0x1U << CANFD_CFDGPFLPTs_GPFLRANG1_Pos)


#define    FL_CANFD_GPFLOUT1_WITHIN                               (0x0U << CANFD_CFDGPFLPTs_GPFLOUT1_Pos)
#define    FL_CANFD_GPFLOUT1_OUTSIDE                              (0x1U << CANFD_CFDGPFLPTs_GPFLOUT1_Pos)


#define    FL_CANFD_RM_IDE_STANDARD                               (0x0U << CANFD_CFDRMID_RMIDE_Pos)
#define    FL_CANFD_RM_IDE_EXTENDED                               (0x1U << CANFD_CFDRMID_RMIDE_Pos)

#define    FL_CANFD_RM_RTR_DATA_FRAME                             (0x0U << CANFD_CFDRMID_RMRTR_Pos)
#define    FL_CANFD_RM_RTR_REMOTE_FRAME                           (0x1U << CANFD_CFDRMID_RMRTR_Pos)

#define    FL_CANFD_RF_IDE_STANDARD                               (0x0U << CANFD_CFDRFID_RFIDE_Pos)
#define    FL_CANFD_RF_IDE_EXTENDED                               (0x1U << CANFD_CFDRFID_RFIDE_Pos)

#define    FL_CANFD_RF_RTR_DATA_FRAME                             (0x0U << CANFD_CFDRFID_RFRTR_Pos)
#define    FL_CANFD_RF_RTR_REMOTE_FRAME                           (0x1U << CANFD_CFDRFID_RFRTR_Pos)

#define    FL_CANFD_CF_IDE_STANDARD                               (0x0U << CANFD_CFDCFID_CFIDE_Pos)
#define    FL_CANFD_CF_IDE_EXTENDED                               (0x1U << CANFD_CFDCFID_CFIDE_Pos)


#define    FL_CANFD_CF_RTR_DATA_FRAME                             (0x0U << CANFD_CFDCFID_CFRTR_Pos)
#define    FL_CANFD_CF_RTR_REMOTE_FRAME                           (0x1U << CANFD_CFDCFID_CFRTR_Pos)


#define    FL_CANFD_CF_FDF_DISABLE                                (0x0U << CANFD_CFDCFFDCSTS_CFFDF_Pos)
#define    FL_CANFD_CF_FDF_ENABLE                                 (0x1U << CANFD_CFDCFFDCSTS_CFFDF_Pos)


#define    FL_CANFD_CF_BRS_DISABLE                                (0x0U << CANFD_CFDCFFDCSTS_CFBRS_Pos)
#define    FL_CANFD_CF_BRS_ENABLE                                 (0x1U << CANFD_CFDCFFDCSTS_CFBRS_Pos)


#define    FL_CANFD_CF_ESI_DISABLE                                (0x0U << CANFD_CFDCFFDCSTS_CFESI_Pos)
#define    FL_CANFD_CF_ESI_ENABLE                                 (0x1U << CANFD_CFDCFFDCSTS_CFESI_Pos)


#define    FL_CANFD_TM_IDE_STANDARD                               (0x0U << CANFD_CFDTMID_TMIDE_Pos)
#define    FL_CANFD_TM_IDE_EXTENDED                               (0x1U << CANFD_CFDTMID_TMIDE_Pos)


#define    FL_CANFD_TM_RTR_DATA_FRAME                             (0x0U << CANFD_CFDTMID_TMRTR_Pos)
#define    FL_CANFD_TM_RTR_REMOTE_FRAME                           (0x1U << CANFD_CFDTMID_TMRTR_Pos)


#define    FL_CANFD_TM_FDF_DISABLE                                (0x0U << CANFD_CFDTMFDCTR_TMFDF_Pos)
#define    FL_CANFD_TM_FDF_ENABLE                                 (0x1U << CANFD_CFDTMFDCTR_TMFDF_Pos)


#define    FL_CANFD_TM_BRS_DISABLE                                (0x0U << CANFD_CFDTMFDCTR_TMBRS_Pos)
#define    FL_CANFD_TM_BRS_ENABLE                                 (0x1U << CANFD_CFDTMFDCTR_TMBRS_Pos)


#define    FL_CANFD_TM_ESI_DISABLE                                (0x0U << CANFD_CFDTMFDCTR_TMESI_Pos)
#define    FL_CANFD_TM_ESI_ENABLE                                 (0x1U << CANFD_CFDTMFDCTR_TMESI_Pos)


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup CANFD_FL_Exported_Functions CANFD Exported Functions
  * @{
  */

/**
  * @brief    Set Channel 0 Nominal Bitrate Timing segment 2
  * @rmtoll   CFDC0NCFG    NTSEG2    FL_CANFD_CH0_WriteNominalBitrateTimeSegment2Length
  * @param    CANFDx CANFD instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_WriteNominalBitrateTimeSegment2Length(CANFD_COMMON_Type* CANFDx, uint32_t length)
{
    MODIFY_REG(CANFDx->CFDC0NCFG, (0x7fU << 25U), (length << 25U));
}

/**
  * @brief    Get Channel 0 Nominal Bitrate Timing segment 2
  * @rmtoll   CFDC0NCFG    NTSEG2    FL_CANFD_CH0_ReadNominalBitrateTimeSegment2Length
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadNominalBitrateTimeSegment2Length(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0NCFG, (0x7fU << 25U)) >> 25U);
}

/**
  * @brief    Set Channel 0 Nominal Bitrate Timing segment 1
  * @rmtoll   CFDC0NCFG    NTSEG1    FL_CANFD_CH0_WriteNominalBitrateTimeSegment1Length
  * @param    CANFDx CANFD instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_WriteNominalBitrateTimeSegment1Length(CANFD_COMMON_Type* CANFDx, uint32_t length)
{
    MODIFY_REG(CANFDx->CFDC0NCFG, (0xffU << 17U), (length << 17U));
}

/**
  * @brief    Get Channel 0 Nominal Bitrate Timing segment 1
  * @rmtoll   CFDC0NCFG    NTSEG1    FL_CANFD_CH0_ReadNominalBitrateTimeSegment1Length
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadNominalBitrateTimeSegment1Length(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0NCFG, (0xffU << 17U)) >> 17U);
}

/**
  * @brief    Set Channel 0 Nominal Bitrate Resynchronization jump width
  * @rmtoll   CFDC0NCFG    NSJW    FL_CANFD_CH0_WriteNominalBitrateSyncJumpWidth
  * @param    CANFDx CANFD instance
  * @param    width 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_WriteNominalBitrateSyncJumpWidth(CANFD_COMMON_Type* CANFDx, uint32_t width)
{
    MODIFY_REG(CANFDx->CFDC0NCFG, (0x7fU << 10U), (width << 10U));
}

/**
  * @brief    Get Channel 0 Nominal Bitrate Resynchronization jump width
  * @rmtoll   CFDC0NCFG    NSJW    FL_CANFD_CH0_ReadNominalBitrateSyncJumpWidth
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadNominalBitrateSyncJumpWidth(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0NCFG, (0x7fU << 10U)) >> 10U);
}

/**
  * @brief    Set Channel 0 Nominal Bitrate prescaler
  * @rmtoll   CFDC0NCFG    NBRP    FL_CANFD_CH0_WriteNominalBitratePrescaler
  * @param    CANFDx CANFD instance
  * @param    psc 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_WriteNominalBitratePrescaler(CANFD_COMMON_Type* CANFDx, uint32_t psc)
{
    MODIFY_REG(CANFDx->CFDC0NCFG, (0x3ffU << 0U), (psc << 0U));
}

/**
  * @brief    Get Channel 0 Nominal Bitrate prescaler
  * @rmtoll   CFDC0NCFG    NBRP    FL_CANFD_CH0_ReadNominalBitratePrescaler
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadNominalBitratePrescaler(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0NCFG, (0x3ffU << 0U)) >> 0U);
}

/**
  * @brief    Channel 0 Restricted operation mode enable
  * @rmtoll   CFDC0CTR    ROM    FL_CANFD_CH0_EnableRestrictedOperationMode
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableRestrictedOperationMode(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_ROM_Msk);
}

/**
  * @brief    Channel 0 Restricted operation mode disable
  * @rmtoll   CFDC0CTR    ROM    FL_CANFD_CH0_DisableRestrictedOperationMode
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableRestrictedOperationMode(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_ROM_Msk);
}

/**
  * @brief    Get Channel 0 Restricted operation mode enable status
  * @rmtoll   CFDC0CTR    ROM    FL_CANFD_CH0_IsEnabledRestrictedOperationMode
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledRestrictedOperationMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_ROM_Msk) == CANFD_CFDC0CTR_ROM_Msk);
}

/**
  * @brief    Channel 0 Bit flip test enable
  * @rmtoll   CFDC0CTR    BFT    FL_CANFD_CH0_EnableBitFlipTest
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableBitFlipTest(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BFT_Msk);
}

/**
  * @brief    Channel 0 Bit flip test disable
  * @rmtoll   CFDC0CTR    BFT    FL_CANFD_CH0_DisableBitFlipTest
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableBitFlipTest(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BFT_Msk);
}

/**
  * @brief    Get Channel 0 Bit flip test enable status
  * @rmtoll   CFDC0CTR    BFT    FL_CANFD_CH0_IsEnabledBitFlipTest
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledBitFlipTest(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BFT_Msk) == CANFD_CFDC0CTR_BFT_Msk);
}

/**
  * @brief    Set Channel 0 Channel test mode
  * @rmtoll   CFDC0CTR    CTMS    FL_CANFD_CH0_SetChannelTestMode
  * @param    CANFDx CANFD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CHANNEL_TEST_MODE_BASIC
  *           @arg @ref FL_CANFD_CHANNEL_TEST_MODE_LISTEN
  *           @arg @ref FL_CANFD_CHANNEL_TEST_MODE_SELFTEST0
  *           @arg @ref FL_CANFD_CHANNEL_TEST_MODE_SELFTEST1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_SetChannelTestMode(CANFD_COMMON_Type* CANFDx, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CTMS_Msk, mode);
}

/**
  * @brief    Get Channel 0 Channel test mode
  * @rmtoll   CFDC0CTR    CTMS    FL_CANFD_CH0_GetChannelTestMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CHANNEL_TEST_MODE_BASIC
  *           @arg @ref FL_CANFD_CHANNEL_TEST_MODE_LISTEN
  *           @arg @ref FL_CANFD_CHANNEL_TEST_MODE_SELFTEST0
  *           @arg @ref FL_CANFD_CHANNEL_TEST_MODE_SELFTEST1
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_GetChannelTestMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CTMS_Msk));
}

/**
  * @brief    Channel 0 Channel test mode enable
  * @rmtoll   CFDC0CTR    CTME    FL_CANFD_CH0_EnableChannelTestMode
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableChannelTestMode(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CTME_Msk);
}

/**
  * @brief    Channel 0 Channel test mode disable
  * @rmtoll   CFDC0CTR    CTME    FL_CANFD_CH0_DisableChannelTestMode
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableChannelTestMode(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CTME_Msk);
}

/**
  * @brief    Get Channel 0 Channel test mode enable status
  * @rmtoll   CFDC0CTR    CTME    FL_CANFD_CH0_IsEnabledChannelTestMode
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledChannelTestMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_CTME_Msk) == CANFD_CFDC0CTR_CTME_Msk);
}

/**
  * @brief    Set Channel 0 Channel error display type
  * @rmtoll   CFDC0CTR    ERRD    FL_CANFD_CH0_SetChannelErrorDisplayType
  * @param    CANFDx CANFD instance
  * @param    type This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CHANNEL_ERROR_DISPLAY_TYPE_FIRST_GROUP
  *           @arg @ref FL_CANFD_CHANNEL_ERROR_DISPLAY_TYPE_CUMULATIVE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_SetChannelErrorDisplayType(CANFD_COMMON_Type* CANFDx, uint32_t type)
{
    MODIFY_REG(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_ERRD_Msk, type);
}

/**
  * @brief    Get Channel 0 Channel error display type
  * @rmtoll   CFDC0CTR    ERRD    FL_CANFD_CH0_GetChannelErrorDisplayType
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CHANNEL_ERROR_DISPLAY_TYPE_FIRST_GROUP
  *           @arg @ref FL_CANFD_CHANNEL_ERROR_DISPLAY_TYPE_CUMULATIVE
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_GetChannelErrorDisplayType(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_ERRD_Msk));
}

/**
  * @brief    Set Channel 0 Channel Bus-Off Mode
  * @rmtoll   CFDC0CTR    BOM    FL_CANFD_CH0_SetChannelBusOffMode
  * @param    CANFDx CANFD instance
  * @param    type This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CHANNEL_BUSOFF_MODE_NORMAL
  *           @arg @ref FL_CANFD_CHANNEL_BUSOFF_MODE_HALT_AT_BUSOFF_SATRT
  *           @arg @ref FL_CANFD_CHANNEL_BUSOFF_MODE_HALT_AT_BUSOFF_END
  *           @arg @ref FL_CANFD_CHANNEL_BUSOFF_MODE_HALT_BY_SW
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_SetChannelBusOffMode(CANFD_COMMON_Type* CANFDx, uint32_t type)
{
    MODIFY_REG(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BOM_Msk, type);
}

/**
  * @brief    Get Channel 0 Channel Bus-Off Mode
  * @rmtoll   CFDC0CTR    BOM    FL_CANFD_CH0_GetChannelBusOffMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CHANNEL_BUSOFF_MODE_NORMAL
  *           @arg @ref FL_CANFD_CHANNEL_BUSOFF_MODE_HALT_AT_BUSOFF_SATRT
  *           @arg @ref FL_CANFD_CHANNEL_BUSOFF_MODE_HALT_AT_BUSOFF_END
  *           @arg @ref FL_CANFD_CHANNEL_BUSOFF_MODE_HALT_BY_SW
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_GetChannelBusOffMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BOM_Msk));
}

/**
  * @brief    Channel 0 Transceiver Delay Compensation Violation interrupt enable 
  * @rmtoll   CFDC0CTR    TDCVFIE    FL_CANFD_CH0_EnableIT_TransceiverDelayCompensationViolation
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_TransceiverDelayCompensationViolation(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_TDCVFIE_Msk);
}

/**
  * @brief    Channel 0 Transceiver Delay Compensation Violation interrupt enable status 
  * @rmtoll   CFDC0CTR    TDCVFIE    FL_CANFD_CH0_IsEnabledIT_TransceiverDelayCompensationViolation
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_TransceiverDelayCompensationViolation(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_TDCVFIE_Msk) == CANFD_CFDC0CTR_TDCVFIE_Msk);
}

/**
  * @brief    Channel 0 Transceiver Delay Compensation Violation  interrupt disable 
  * @rmtoll   CFDC0CTR    TDCVFIE    FL_CANFD_CH0_DisableIT_TransceiverDelayCompensationViolation
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_TransceiverDelayCompensationViolation(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_TDCVFIE_Msk);
}

/**
  * @brief    Channel 0 Successful occurrence counter overflow interrupt enable 
  * @rmtoll   CFDC0CTR    SOCOIE    FL_CANFD_CH0_EnableIT_SuccessfulOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_SuccessfulOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_SOCOIE_Msk);
}

/**
  * @brief    Channel 0 Successful occurrence counter overflow interrupt enable status 
  * @rmtoll   CFDC0CTR    SOCOIE    FL_CANFD_CH0_IsEnabledIT_SuccessfulOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_SuccessfulOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_SOCOIE_Msk) == CANFD_CFDC0CTR_SOCOIE_Msk);
}

/**
  * @brief    Channel 0 Successful occurrence counter overflow  interrupt disable 
  * @rmtoll   CFDC0CTR    SOCOIE    FL_CANFD_CH0_DisableIT_SuccessfulOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_SuccessfulOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_SOCOIE_Msk);
}

/**
  * @brief    Channel 0 Error occurrence counter overflow interrupt enable 
  * @rmtoll   CFDC0CTR    EOCOIE    FL_CANFD_CH0_EnableIT_ErrorOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_ErrorOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_EOCOIE_Msk);
}

/**
  * @brief    Channel 0 Error occurrence counter overflow interrupt enable status 
  * @rmtoll   CFDC0CTR    EOCOIE    FL_CANFD_CH0_IsEnabledIT_ErrorOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_ErrorOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_EOCOIE_Msk) == CANFD_CFDC0CTR_EOCOIE_Msk);
}

/**
  * @brief    Channel 0 Error occurrence counter overflow  interrupt disable 
  * @rmtoll   CFDC0CTR    EOCOIE    FL_CANFD_CH0_DisableIT_ErrorOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_ErrorOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_EOCOIE_Msk);
}

/**
  * @brief    Channel 0 Transmission abort interrupt enable 
  * @rmtoll   CFDC0CTR    TAIE    FL_CANFD_CH0_EnableIT_TxAbort
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_TxAbort(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_TAIE_Msk);
}

/**
  * @brief    Channel 0 Transmission abort interrupt enable status 
  * @rmtoll   CFDC0CTR    TAIE    FL_CANFD_CH0_IsEnabledIT_TxAbort
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_TxAbort(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_TAIE_Msk) == CANFD_CFDC0CTR_TAIE_Msk);
}

/**
  * @brief    Channel 0 Transmission abort  interrupt disable 
  * @rmtoll   CFDC0CTR    TAIE    FL_CANFD_CH0_DisableIT_TxAbort
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_TxAbort(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_TAIE_Msk);
}

/**
  * @brief    Channel 0 Arbitration Lost  interrupt enable 
  * @rmtoll   CFDC0CTR    ALIE    FL_CANFD_CH0_EnableIT_ArbitrationLost
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_ArbitrationLost(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_ALIE_Msk);
}

/**
  * @brief    Channel 0 Arbitration Lost  interrupt enable status 
  * @rmtoll   CFDC0CTR    ALIE    FL_CANFD_CH0_IsEnabledIT_ArbitrationLost
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_ArbitrationLost(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_ALIE_Msk) == CANFD_CFDC0CTR_ALIE_Msk);
}

/**
  * @brief    Channel 0 Arbitration Lost   interrupt disable 
  * @rmtoll   CFDC0CTR    ALIE    FL_CANFD_CH0_DisableIT_ArbitrationLost
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_ArbitrationLost(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_ALIE_Msk);
}

/**
  * @brief    Channel 0 Bus Lock interrupt enable 
  * @rmtoll   CFDC0CTR    BLIE    FL_CANFD_CH0_EnableIT_BusLock
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_BusLock(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BLIE_Msk);
}

/**
  * @brief    Channel 0 Bus Lock interrupt enable status 
  * @rmtoll   CFDC0CTR    BLIE    FL_CANFD_CH0_IsEnabledIT_BusLock
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_IsEnabledIT_BusLock(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BLIE_Msk) == CANFD_CFDC0CTR_BLIE_Msk);
}

/**
  * @brief    Channel 0 Bus Lock interrupt disable 
  * @rmtoll   CFDC0CTR    BLIE    FL_CANFD_CH0_DisableIT_BusLock
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_DisableIT_BusLock(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_BLIE_Msk);
}

/**
  * @brief    Channel 0 Overload interrupt enable 
  * @rmtoll   CFDC0CTR    OLIE    FL_CANFD_CH0_EnableIT_Overload
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_EnableIT_Overload(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0CTR, CANFD_CFDC0CTR_OLIE_Msk);
}

