Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_canfd.h
/**
  * @brief    Get Global Acceptance Filter List Entry RTR Mask
  * @rmtoll   CFDGAFLMr    GAFLRTRM    FL_CANFD_Global_GetGAFLRTRMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_RTRM_NOT_CONSIDERED
  *           @arg @ref FL_CANFD_GAFL_RTRM_CONSIDERED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLRTRMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLMr, CANFD_CFDGAFLMr_GAFLRTRM_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List Information Label 1
  * @rmtoll   CFDGAFLMr    GAFLIFL1    FL_CANFD_Global_SetGAFLInfoLabel1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    label This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL1_0
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL1_1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLInfoLabel1(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t label)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLMr, CANFD_CFDGAFLMr_GAFLIFL1_Msk, label);
}

/**
  * @brief    Get Global Acceptance Filter List Information Label 1
  * @rmtoll   CFDGAFLMr    GAFLIFL1    FL_CANFD_Global_GetGAFLInfoLabel1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL1_0
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL1_1
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLInfoLabel1(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLMr, CANFD_CFDGAFLMr_GAFLIFL1_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List Entry ID Mask Field
  * @rmtoll   CFDGAFLMr    GAFLIDM    FL_CANFD_Global_WriteGAFLIDMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    idm 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGAFLIDMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t idm)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLMr, (0x1fffffffU << 0U), (idm << 0U));
}

/**
  * @brief    Get Global Acceptance Filter List Entry ID Mask Field
  * @rmtoll   CFDGAFLMr    GAFLIDM    FL_CANFD_Global_ReadGAFLIDMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGAFLIDMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLMr, (0x1fffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Acceptance Filter List Pointer Field
  * @rmtoll   CFDGAFLP0r    GAFLPTR    FL_CANFD_Global_WriteGAFLPointer
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    ptr 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGAFLPointer(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t ptr)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, (0xffffU << 16U), (ptr << 16U));
}

/**
  * @brief    Get Global Acceptance Filter List Pointer Field
  * @rmtoll   CFDGAFLP0r    GAFLPTR    FL_CANFD_Global_ReadGAFLPointer
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGAFLPointer(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Set Global Acceptance Filter List RX Message Buffer Valid
  * @rmtoll   CFDGAFLP0r    GAFLRMV    FL_CANFD_Global_SetGAFLRxMBValid
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    valid This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_SINGLE_RXMB_INVALID
  *           @arg @ref FL_CANFD_GAFL_SINGLE_RXMB_VALID
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLRxMBValid(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t valid)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, CANFD_CFDGAFLP0r_GAFLRMV_Msk, valid);
}

/**
  * @brief    Get Global Acceptance Filter List RX Message Buffer Valid
  * @rmtoll   CFDGAFLP0r    GAFLRMV    FL_CANFD_Global_GetGAFLRxMBValid
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_SINGLE_RXMB_INVALID
  *           @arg @ref FL_CANFD_GAFL_SINGLE_RXMB_VALID
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLRxMBValid(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, CANFD_CFDGAFLP0r_GAFLRMV_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List RX Message Buffer Direction Pointer
  * @rmtoll   CFDGAFLP0r    GAFLRMDP    FL_CANFD_Global_WriteGAFLRxMBDirectionPointer
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    number 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGAFLRxMBDirectionPointer(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t number)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, (0x1fU << 8U), (number << 8U));
}

/**
  * @brief    Get Global Acceptance Filter List RX Message Buffer Direction Pointer
  * @rmtoll   CFDGAFLP0r    GAFLRMDP    FL_CANFD_Global_ReadGAFLRxMBDirectionPointer
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGAFLRxMBDirectionPointer(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, (0x1fU << 8U)) >> 8U);
}

/**
  * @brief    Set Global Acceptance Filter List Information Label 0
  * @rmtoll   CFDGAFLP0r    GAFLIFL0    FL_CANFD_Global_SetGAFLInfoLabel0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    label This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL0_0
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL0_1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLInfoLabel0(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t label)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, CANFD_CFDGAFLP0r_GAFLIFL0_Msk, label);
}

/**
  * @brief    Get Global Acceptance Filter List Information Label 0
  * @rmtoll   CFDGAFLP0r    GAFLIFL0    FL_CANFD_Global_GetGAFLInfoLabel0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL0_0
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL0_1
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLInfoLabel0(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, CANFD_CFDGAFLP0r_GAFLIFL0_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List DLC Field
  * @rmtoll   CFDGAFLP0r    GAFLDLC    FL_CANFD_Global_WriteGAFLDLC
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGAFLDLC(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t length)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, (0xfU << 0U), (length << 0U));
}

/**
  * @brief    Get Global Acceptance Filter List DLC Field
  * @rmtoll   CFDGAFLP0r    GAFLDLC    FL_CANFD_Global_ReadGAFLDLC
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGAFLDLC(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLP0r, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Global Acceptance Filter List Common FIFO Reception enable 
  * @rmtoll   CFDGAFLP1r    GAFLFDPH    FL_CANFD_Global_Enable_GAFLCommonFIFOReception
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_GAFLCommonFIFOReception(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    SET_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLP1r, CANFD_CFDGAFLP1r_GAFLFDPH_Msk);
}

/**
  * @brief    Global Acceptance Filter List Common FIFO Reception enable status 
  * @rmtoll   CFDGAFLP1r    GAFLFDPH    FL_CANFD_Global_IsEnabled_GAFLCommonFIFOReception
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_GAFLCommonFIFOReception(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLP1r, CANFD_CFDGAFLP1r_GAFLFDPH_Msk) == CANFD_CFDGAFLP1r_GAFLFDPH_Msk);
}

/**
  * @brief    Global Acceptance Filter List Common FIFO Reception disable 
  * @rmtoll   CFDGAFLP1r    GAFLFDPH    FL_CANFD_Global_Disable_GAFLCommonFIFOReception
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_GAFLCommonFIFOReception(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    CLEAR_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLP1r, CANFD_CFDGAFLP1r_GAFLFDPH_Msk);
}

