Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_canfd.h
/**
  * @brief    Get Global RX FIFO Full
  * @rmtoll   CFDRFSTSa    RFFLL    FL_CANFD_Global_IsActiveFlag_RxFIFOFull
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxFIFOFull(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFSTS[rxfifoX], CANFD_CFDRFSTSa_RFFLL_Msk) == (CANFD_CFDRFSTSa_RFFLL_Msk));
}

/**
  * @brief    Get Global RX FIFO Empty
  * @rmtoll   CFDRFSTSa    RFEMP    FL_CANFD_Global_IsActiveFlag_RxFIFOEmpty
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxFIFOEmpty(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFSTS[rxfifoX], CANFD_CFDRFSTSa_RFEMP_Msk) == (CANFD_CFDRFSTSa_RFEMP_Msk));
}

/**
  * @brief    Set Global RX FIFO Pointer
  * @rmtoll   CFDRFPCTRa    RFPC    FL_CANFD_Global_WriteRxFIFOPointer
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @param    pointer 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteRxFIFOPointer(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX, uint32_t pointer)
{
    MODIFY_REG(CANFDx->CFDRFPCTR[rxfifoX], (0xffU << 0U), (pointer << 0U));
}

/**
  * @brief    Set Global Common FIFO Interval Transmission Time
  * @rmtoll   CFDCFCC    CFITT    FL_CANFD_Global_WriteCommonFIFOIntervalTransmissionTime
  * @param    CANFDx CANFD instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteCommonFIFOIntervalTransmissionTime(CANFD_COMMON_Type* CANFDx, uint32_t time)
{
    MODIFY_REG(CANFDx->CFDCFCC, (0xffU << 24U), (time << 24U));
}

/**
  * @brief    Get Global Common FIFO Interval Transmission Time
  * @rmtoll   CFDCFCC    CFITT    FL_CANFD_Global_ReadCommonFIFOIntervalTransmissionTime
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadCommonFIFOIntervalTransmissionTime(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, (0xffU << 24U)) >> 24U);
}

/**
  * @brief    Set Global Common FIFO Depth Configuration
  * @rmtoll   CFDCFCC    CFDC    FL_CANFD_Global_SetCommonFIFODepth
  * @param    CANFDx CANFD instance
  * @param    depth This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFDC_DEPTH_0
  *           @arg @ref FL_CANFD_CFDC_DEPTH_4
  *           @arg @ref FL_CANFD_CFDC_DEPTH_8
  *           @arg @ref FL_CANFD_CFDC_DEPTH_16
  *           @arg @ref FL_CANFD_CFDC_DEPTH_32
  *           @arg @ref FL_CANFD_CFDC_DEPTH_48
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFODepth(CANFD_COMMON_Type* CANFDx, uint32_t depth)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFDC_Msk, depth);
}

/**
  * @brief    Get Global Common FIFO Depth Configuration
  * @rmtoll   CFDCFCC    CFDC    FL_CANFD_Global_GetCommonFIFODepth
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CFDC_DEPTH_0
  *           @arg @ref FL_CANFD_CFDC_DEPTH_4
  *           @arg @ref FL_CANFD_CFDC_DEPTH_8
  *           @arg @ref FL_CANFD_CFDC_DEPTH_16
  *           @arg @ref FL_CANFD_CFDC_DEPTH_32
  *           @arg @ref FL_CANFD_CFDC_DEPTH_48
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFODepth(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFDC_Msk));
}

/**
  * @brief    Set Global Common FIFO TX Message Buffer Link
  * @rmtoll   CFDCFCC    CFTML    FL_CANFD_Global_SetCommonFIFOTxMBLink
  * @param    CANFDx CANFD instance
  * @param    number This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFTML_TXMB0
  *           @arg @ref FL_CANFD_CFTML_TXMB1
  *           @arg @ref FL_CANFD_CFTML_TXMB2
  *           @arg @ref FL_CANFD_CFTML_TXMB3
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOTxMBLink(CANFD_COMMON_Type* CANFDx, uint32_t number)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFTML_Msk, number);
}

/**
  * @brief    Get Global Common FIFO TX Message Buffer Link
  * @rmtoll   CFDCFCC    CFTML    FL_CANFD_Global_GetCommonFIFOTxMBLink
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CFTML_TXMB0
  *           @arg @ref FL_CANFD_CFTML_TXMB1
  *           @arg @ref FL_CANFD_CFTML_TXMB2
  *           @arg @ref FL_CANFD_CFTML_TXMB3
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOTxMBLink(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFTML_Msk));
}

/**
  * @brief    Set Global Common FIFO Interrupt Generation Counter Value
  * @rmtoll   CFDCFCC    CFIGCV    FL_CANFD_Global_SetCommonFIFOInterruptGenerationCounterValue
  * @param    CANFDx CANFD instance
  * @param    value This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFIGCV_1P8_FULL
  *           @arg @ref FL_CANFD_CFIGCV_1P4_FULL
  *           @arg @ref FL_CANFD_CFIGCV_3P8_FULL
  *           @arg @ref FL_CANFD_CFIGCV_1P2_FULL
  *           @arg @ref FL_CANFD_CFIGCV_5P8_FULL
  *           @arg @ref FL_CANFD_CFIGCV_3P4_FULL
  *           @arg @ref FL_CANFD_CFIGCV_7P8_FULL
  *           @arg @ref FL_CANFD_CFIGCV_FULL
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOInterruptGenerationCounterValue(CANFD_COMMON_Type* CANFDx, uint32_t value)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFIGCV_Msk, value);
}

/**
  * @brief    Get Global Common FIFO Interrupt Generation Counter Value
  * @rmtoll   CFDCFCC    CFIGCV    FL_CANFD_Global_GetCommonFIFOInterruptGenerationCounterValue
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CFIGCV_1P8_FULL
  *           @arg @ref FL_CANFD_CFIGCV_1P4_FULL
  *           @arg @ref FL_CANFD_CFIGCV_3P8_FULL
  *           @arg @ref FL_CANFD_CFIGCV_1P2_FULL
  *           @arg @ref FL_CANFD_CFIGCV_5P8_FULL
  *           @arg @ref FL_CANFD_CFIGCV_3P4_FULL
  *           @arg @ref FL_CANFD_CFIGCV_7P8_FULL
  *           @arg @ref FL_CANFD_CFIGCV_FULL
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOInterruptGenerationCounterValue(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFIGCV_Msk));
}

/**
  * @brief    Set Global Common FIFO Interrupt Mode
  * @rmtoll   CFDCFCC    CFIM    FL_CANFD_Global_SetCommonFIFOInterruptMode
  * @param    CANFDx CANFD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFIM_REACH_RFIGCV
  *           @arg @ref FL_CANFD_CFIM_EVERY_MESSAGE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOInterruptMode(CANFD_COMMON_Type* CANFDx, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFIM_Msk, mode);
}

/**
  * @brief    Get Global Common FIFO Interrupt Mode
  * @rmtoll   CFDCFCC    CFIM    FL_CANFD_Global_GetCommonFIFOInterruptMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CFIM_REACH_RFIGCV
  *           @arg @ref FL_CANFD_CFIM_EVERY_MESSAGE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOInterruptMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFIM_Msk));
}

/**
  * @brief    Set Global Common FIFO Interval Timer Resolution
  * @rmtoll   CFDCFCC    CFITR    FL_CANFD_Global_SetCommonFIFOIntervalTimerResolution
  * @param    CANFDx CANFD instance
  * @param    resolution This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFITR_REF_CLOCK_MUL_1
  *           @arg @ref FL_CANFD_CFITR_REF_CLOCK_MUL_10
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOIntervalTimerResolution(CANFD_COMMON_Type* CANFDx, uint32_t resolution)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFITR_Msk, resolution);
}

/**
  * @brief    Get Global Common FIFO Interval Timer Resolution
  * @rmtoll   CFDCFCC    CFITR    FL_CANFD_Global_GetCommonFIFOIntervalTimerResolution
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CFITR_REF_CLOCK_MUL_1
  *           @arg @ref FL_CANFD_CFITR_REF_CLOCK_MUL_10
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOIntervalTimerResolution(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFITR_Msk));
}

/**
  * @brief    Set Global Common FIFO Interval Timer Source Select
  * @rmtoll   CFDCFCC    CFITSS    FL_CANFD_Global_SetCommonFIFOIntervalTimerSource
  * @param    CANFDx CANFD instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFITSS_REF_CLOCK
  *           @arg @ref FL_CANFD_CFITSS_BIT_CLOCK
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOIntervalTimerSource(CANFD_COMMON_Type* CANFDx, uint32_t source)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFITSS_Msk, source);
}

/**
  * @brief    Get Global Common FIFO Interval Timer Source Select
  * @rmtoll   CFDCFCC    CFITSS    FL_CANFD_Global_GetCommonFIFOIntervalTimerSource
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CFITSS_REF_CLOCK
  *           @arg @ref FL_CANFD_CFITSS_BIT_CLOCK
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOIntervalTimerSource(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFITSS_Msk));
}

/**
  * @brief    Set Global Common FIFO Mode
  * @rmtoll   CFDCFCC    CFM    FL_CANFD_Global_SetCommonFIFOMode
  * @param    CANFDx CANFD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFM_RX_FIFO
  *           @arg @ref FL_CANFD_CFM_TX_FIFO
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOMode(CANFD_COMMON_Type* CANFDx, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFM_Msk, mode);
}

/**
  * @brief    Get Global Common FIFO Mode
  * @rmtoll   CFDCFCC    CFM    FL_CANFD_Global_GetCommonFIFOMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CFM_RX_FIFO
  *           @arg @ref FL_CANFD_CFM_TX_FIFO
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFM_Msk));
}

/**
  * @brief    Set Global Common FIFO Payload Data Size configuration
  * @rmtoll   CFDCFCC    CFPLS    FL_CANFD_Global_SetCommonFIFOPayloadDataSize
  * @param    CANFDx CANFD instance
  * @param    size This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFPLS_SIZE_8
  *           @arg @ref FL_CANFD_CFPLS_SIZE_12
  *           @arg @ref FL_CANFD_CFPLS_SIZE_16
  *           @arg @ref FL_CANFD_CFPLS_SIZE_20
  *           @arg @ref FL_CANFD_CFPLS_SIZE_24
  *           @arg @ref FL_CANFD_CFPLS_SIZE_32
  *           @arg @ref FL_CANFD_CFPLS_SIZE_48
  *           @arg @ref FL_CANFD_CFPLS_SIZE_64
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOPayloadDataSize(CANFD_COMMON_Type* CANFDx, uint32_t size)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFPLS_Msk, size);
}

/**
  * @brief    Get Global Common FIFO Payload Data Size configuration
  * @rmtoll   CFDCFCC    CFPLS    FL_CANFD_Global_GetCommonFIFOPayloadDataSize
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CFPLS_SIZE_8
  *           @arg @ref FL_CANFD_CFPLS_SIZE_12
  *           @arg @ref FL_CANFD_CFPLS_SIZE_16
  *           @arg @ref FL_CANFD_CFPLS_SIZE_20
  *           @arg @ref FL_CANFD_CFPLS_SIZE_24
  *           @arg @ref FL_CANFD_CFPLS_SIZE_32
  *           @arg @ref FL_CANFD_CFPLS_SIZE_48
  *           @arg @ref FL_CANFD_CFPLS_SIZE_64
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFOPayloadDataSize(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFPLS_Msk));
}

/**
  * @brief    Global Common FIFO TX Interrupt enable 
  * @rmtoll   CFDCFCC    CFTXIE    FL_CANFD_Global_EnableIT_CommonFIFOTx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_CommonFIFOTx(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFTXIE_Msk);
}

/**
  * @brief    Global Common FIFO TX Interrupt enable status 
  * @rmtoll   CFDCFCC    CFTXIE    FL_CANFD_Global_IsEnabledIT_CommonFIFOTx
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_CommonFIFOTx(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFTXIE_Msk) == CANFD_CFDCFCC_CFTXIE_Msk);
}

/**
  * @brief    Global Common FIFO TX Interrupt disable 
  * @rmtoll   CFDCFCC    CFTXIE    FL_CANFD_Global_DisableIT_CommonFIFOTx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_CommonFIFOTx(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFTXIE_Msk);
}

/**
  * @brief    Global Common FIFO RX Interrupt enable 
  * @rmtoll   CFDCFCC    CFRXIE    FL_CANFD_Global_EnableIT_CommonFIFORx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_CommonFIFORx(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFRXIE_Msk);
}

/**
  * @brief    Global Common FIFO RX Interrupt enable status 
  * @rmtoll   CFDCFCC    CFRXIE    FL_CANFD_Global_IsEnabledIT_CommonFIFORx
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_CommonFIFORx(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFRXIE_Msk) == CANFD_CFDCFCC_CFRXIE_Msk);
}

/**
  * @brief    Global Common FIFO RX Interrupt disable 
  * @rmtoll   CFDCFCC    CFRXIE    FL_CANFD_Global_DisableIT_CommonFIFORx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_CommonFIFORx(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFRXIE_Msk);
}

/**
  * @brief    Global Common FIFO enable 
  * @rmtoll   CFDCFCC    CFE    FL_CANFD_Global_Enable_CommonFIFO
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_CommonFIFO(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFE_Msk);
}

/**
  * @brief    Global Common FIFO enable status 
  * @rmtoll   CFDCFCC    CFE    FL_CANFD_Global_IsEnabled_CommonFIFO
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_CommonFIFO(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFE_Msk) == CANFD_CFDCFCC_CFE_Msk);
}

/**
  * @brief    Global Common FIFO disable 
  * @rmtoll   CFDCFCC    CFE    FL_CANFD_Global_Disable_CommonFIFO
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_CommonFIFO(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFE_Msk);
}

/**
  * @brief    Get Global Common FIFO Message Count
  * @rmtoll   CFDCFSTS    CFMC    FL_CANFD_Global_ReadCommonFIFOMessageCount
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadCommonFIFOMessageCount(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFSTS, (0x3fU << 8U)) >> 8U);
}

/**
  * @brief    Get Global Common  FIFO TX Interrupt Flag
  * @rmtoll   CFDCFSTS    CFTXIF    FL_CANFD_Global_IsActiveFlag_CommonFIFOTx
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_CommonFIFOTx(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFSTS, CANFD_CFDCFSTS_CFTXIF_Msk) == (CANFD_CFDCFSTS_CFTXIF_Msk));
}

/**
  * @brief    Clear Global Common FIFO TX Interrupt Flag
  * @rmtoll   CFDCFSTS    CFTXIF    FL_CANFD_Global_ClearFlag_CommonFIFOTx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_CommonFIFOTx(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDCFSTS, CANFD_CFDCFSTS_CFTXIF_Msk);
}

/**
  * @brief    Get Global Common  FIFO RX Interrupt Flag
  * @rmtoll   CFDCFSTS    CFRXIF    FL_CANFD_Global_IsActiveFlag_CommonFIFORx
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_CommonFIFORx(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFSTS, CANFD_CFDCFSTS_CFRXIF_Msk) == (CANFD_CFDCFSTS_CFRXIF_Msk));
}

/**
  * @brief    Clear Global Common FIFO RX Interrupt Flag
  * @rmtoll   CFDCFSTS    CFRXIF    FL_CANFD_Global_ClearFlag_CommonFIFORx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_CommonFIFORx(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDCFSTS, CANFD_CFDCFSTS_CFRXIF_Msk);
}

/**
  * @brief    Get Global Common FIFO Message Lost Flag
  * @rmtoll   CFDCFSTS    CFMLT    FL_CANFD_Global_IsActiveFlag_CommonFIFOMessageLoast
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_CommonFIFOMessageLoast(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFSTS, CANFD_CFDCFSTS_CFMLT_Msk) == (CANFD_CFDCFSTS_CFMLT_Msk));
}

/**
  * @brief    Clear Global Common FIFO Message Lost Flag
  * @rmtoll   CFDCFSTS    CFMLT    FL_CANFD_Global_ClearFlag_CommonFIFOMessageLoast
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_CommonFIFOMessageLoast(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDCFSTS, CANFD_CFDCFSTS_CFMLT_Msk);
}

/**
  * @brief    Get Global Common FIFO Full
  * @rmtoll   CFDCFSTS    CFFLL    FL_CANFD_Global_IsActiveFlag_CommonFIFOFull
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_CommonFIFOFull(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFSTS, CANFD_CFDCFSTS_CFFLL_Msk) == (CANFD_CFDCFSTS_CFFLL_Msk));
}

/**
  * @brief    Get Global Common FIFO Empty
  * @rmtoll   CFDCFSTS    CFEMP    FL_CANFD_Global_IsActiveFlag_CommonFIFOEmpty
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_CommonFIFOEmpty(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFSTS, CANFD_CFDCFSTS_CFEMP_Msk) == (CANFD_CFDCFSTS_CFEMP_Msk));
}

/**
  * @brief    Set Global Common FIFO Pointer
  * @rmtoll   CFDCFPCTR    CFPC    FL_CANFD_Global_WriteCommonFIFOPointer
  * @param    CANFDx CANFD instance
  * @param    pointer 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteCommonFIFOPointer(CANFD_COMMON_Type* CANFDx, uint32_t pointer)
{
    MODIFY_REG(CANFDx->CFDCFPCTR, (0xffU << 0U), (pointer << 0U));
}

/**
  * @brief    Get Global Total Common FIFO Empty Status
  * @rmtoll   CFDFESTS    CFEMP    FL_CANFD_Global_IsActiveFlag_TotalCommonFIFOEmpty
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalCommonFIFOEmpty(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDFESTS, CANFD_CFDFESTS_CFEMP_Msk) == (CANFD_CFDFESTS_CFEMP_Msk));
}

/**
  * @brief    Get Global Total RX FIF0 Empty Status
  * @rmtoll   CFDFESTS    RFxEMP    FL_CANFD_Global_IsActiveFlag_TotalRxFIFOEmpty
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalRxFIFOEmpty(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDFESTS, (CANFD_CFDFESTS_RFxEMP_Msk << rxfifoX)) == (CANFD_CFDFESTS_RFxEMP_Msk << rxfifoX));
}

/**
  * @brief    Get Global Total Common FIFO Full Status
  * @rmtoll   CFDFFSTS    CFFLL    FL_CANFD_Global_IsActiveFlag_TotalCommonFIFOFull
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalCommonFIFOFull(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDFFSTS, CANFD_CFDFFSTS_CFFLL_Msk) == (CANFD_CFDFFSTS_CFFLL_Msk));
}

/**
  * @brief    Get Global Total RX FIF0 Full Status
  * @rmtoll   CFDFFSTS    RFxFLL    FL_CANFD_Global_IsActiveFlag_TotalRxFIFOFull
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalRxFIFOFull(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDFFSTS, (CANFD_CFDFFSTS_RFxFLL_Msk << rxfifoX)) == ((CANFD_CFDFFSTS_RFxFLL_Msk << rxfifoX)));
}

/**
  * @brief    Get Global Total Common FIFO Msg Lost Status
  * @rmtoll   CFDFMSTS    CFMLT    FL_CANFD_Global_IsActiveFlag_TotalCommonFIFOMessageLost
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalCommonFIFOMessageLost(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDFMSTS, CANFD_CFDFMSTS_CFMLT_Msk) == (CANFD_CFDFMSTS_CFMLT_Msk));
}

/**
  * @brief    Get Global Total RX FIF0 Msg Lost Status
  * @rmtoll   CFDFMSTS    RFxMLT    FL_CANFD_Global_IsActiveFlag_TotalRxFIFOMessageLost
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalRxFIFOMessageLost(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDFMSTS, (CANFD_CFDFMSTS_RFxMLT_Msk  << rxfifoX)) == ((CANFD_CFDFMSTS_RFxMLT_Msk  << rxfifoX)));
}

